; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-7-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	p0-3 - location
	p0-7 - location
	p0-10 - location
	p1-13 - location
	p3-7 - location
	p4-10 - location
	p5-6 - location
	p5-10 - location
	p6-4 - location
	p6-5 - location
	p6-8 - location
	p6-12 - location
	p8-1 - location
	p8-3 - location
	p8-10 - location
	p9-7 - location
	p9-12 - location
	p10-3 - location
	p10-11 - location
	p10-13 - location
	p11-9 - location
	p12-2 - location
	p12-7 - location
	p13-0 - location
	p13-12 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s4)
	(at driver3 s1)
	(at truck1 s9)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s13)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s6)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s8)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s6)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s10)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at package1 s2)
	(at package2 s10)
	(at package3 s4)
	(at package4 s7)
	(at package5 s8)
	(at package6 s6)
	(at package7 s7)
	(at package8 s0)
	(at package9 s6)
	(at package10 s2)
	(at package11 s5)
	(at package12 s0)
	(at package13 s12)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s0 p0-10)
	(path p0-10 s0)
	(path s10 p0-10)
	(path p0-10 s10)
	(path s1 p1-13)
	(path p1-13 s1)
	(path s13 p1-13)
	(path p1-13 s13)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s6 p6-12)
	(path p6-12 s6)
	(path s12 p6-12)
	(path p6-12 s12)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s8 p8-10)
	(path p8-10 s8)
	(path s10 p8-10)
	(path p8-10 s10)
	(path s9 p9-7)
	(path p9-7 s9)
	(path s7 p9-7)
	(path p9-7 s7)
	(path s9 p9-12)
	(path p9-12 s9)
	(path s12 p9-12)
	(path p9-12 s12)
	(path s10 p10-3)
	(path p10-3 s10)
	(path s3 p10-3)
	(path p10-3 s3)
	(path s10 p10-11)
	(path p10-11 s10)
	(path s11 p10-11)
	(path p10-11 s11)
	(path s10 p10-13)
	(path p10-13 s10)
	(path s13 p10-13)
	(path p10-13 s13)
	(path s11 p11-9)
	(path p11-9 s11)
	(path s9 p11-9)
	(path p11-9 s9)
	(path s12 p12-2)
	(path p12-2 s12)
	(path s2 p12-2)
	(path p12-2 s2)
	(path s12 p12-7)
	(path p12-7 s12)
	(path s7 p12-7)
	(path p12-7 s7)
	(path s13 p13-0)
	(path p13-0 s13)
	(path s0 p13-0)
	(path p13-0 s0)
	(path s13 p13-12)
	(path p13-12 s13)
	(path s12 p13-12)
	(path p13-12 s12)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 49)
	(= (time-to-drive s1 s0) 49)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 61)
	(= (time-to-drive s5 s0) 61)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 94)
	(= (time-to-drive s7 s0) 94)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 42)
	(= (time-to-drive s10 s1) 42)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 81)
	(= (time-to-drive s4 s2) 81)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 8)
	(= (time-to-drive s7 s2) 8)
	(link s2 s13)
	(link s13 s2)
	(= (time-to-drive s2 s13) 25)
	(= (time-to-drive s13 s2) 25)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 4)
	(= (time-to-drive s1 s3) 4)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 24)
	(= (time-to-drive s5 s3) 24)
	(link s3 s11)
	(link s11 s3)
	(= (time-to-drive s3 s11) 70)
	(= (time-to-drive s11 s3) 70)
	(link s3 s12)
	(link s12 s3)
	(= (time-to-drive s3 s12) 60)
	(= (time-to-drive s12 s3) 60)
	(link s3 s13)
	(link s13 s3)
	(= (time-to-drive s3 s13) 27)
	(= (time-to-drive s13 s3) 27)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 6)
	(= (time-to-drive s3 s4) 6)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 92)
	(= (time-to-drive s7 s4) 92)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 73)
	(= (time-to-drive s9 s4) 73)
	(link s4 s12)
	(link s12 s4)
	(= (time-to-drive s4 s12) 88)
	(= (time-to-drive s12 s4) 88)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 11)
	(= (time-to-drive s7 s5) 11)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 92)
	(= (time-to-drive s0 s6) 92)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 76)
	(= (time-to-drive s1 s6) 76)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 67)
	(= (time-to-drive s2 s6) 67)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 10)
	(= (time-to-drive s1 s7) 10)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 15)
	(= (time-to-drive s0 s8) 15)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 3)
	(= (time-to-drive s1 s8) 3)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 58)
	(= (time-to-drive s3 s8) 58)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 64)
	(= (time-to-drive s5 s8) 64)
	(link s8 s11)
	(link s11 s8)
	(= (time-to-drive s8 s11) 9)
	(= (time-to-drive s11 s8) 9)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 49)
	(= (time-to-drive s1 s9) 49)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 26)
	(= (time-to-drive s3 s9) 26)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 36)
	(= (time-to-drive s7 s10) 36)
	(link s11 s0)
	(link s0 s11)
	(= (time-to-drive s11 s0) 97)
	(= (time-to-drive s0 s11) 97)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 44)
	(= (time-to-drive s7 s11) 44)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 85)
	(= (time-to-drive s12 s11) 85)
	(link s11 s13)
	(link s13 s11)
	(= (time-to-drive s11 s13) 57)
	(= (time-to-drive s13 s11) 57)
	(link s12 s8)
	(link s8 s12)
	(= (time-to-drive s12 s8) 37)
	(= (time-to-drive s8 s12) 37)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 26)
	(= (time-to-drive s9 s12) 26)
	(link s13 s0)
	(link s0 s13)
	(= (time-to-drive s13 s0) 38)
	(= (time-to-drive s0 s13) 38)
	(link s13 s1)
	(link s1 s13)
	(= (time-to-drive s13 s1) 44)
	(= (time-to-drive s1 s13) 44)
	(link s13 s7)
	(link s7 s13)
	(= (time-to-drive s13 s7) 51)
	(= (time-to-drive s7 s13) 51)
	(link s13 s8)
	(link s8 s13)
	(= (time-to-drive s13 s8) 41)
	(= (time-to-drive s8 s13) 41)
	(link s13 s10)
	(link s10 s13)
	(= (time-to-drive s13 s10) 67)
	(= (time-to-drive s10 s13) 67)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s3)
	(at truck2 s12)
	(at truck4 s11)
	(at truck5 s0)
	(at truck6 s5)
	(at package1 s13)
	(at package2 s4)
	(at package3 s5)
	(at package4 s1)
	(at package5 s6)
	(at package6 s6)
	(at package7 s12)
	(at package8 s7)
	(at package9 s0)
	(at package10 s10)
	(at package12 s8)
	(at package13 s12)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver1 truck4 s6)
   deleted: (at driver1 s6) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 2 of 18
2. (drive-truck truck4 s6 s0 driver1)
   deleted: (at truck4 s6)
   added: (at truck4 s0)
   changed: (fuel-used) from 0 to 920
   goals met: 2 of 18
3. (drive-truck truck4 s0 s8 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s8)
   changed: (fuel-used) from 920 to 1070
   goals met: 2 of 18
4. (walk driver2 s4 p6-4)
   deleted: (at driver2 s4)
   added: (at driver2 p6-4)
   goals met: 2 of 18
5. (drive-truck truck4 s8 s5 driver1)
   deleted: (at truck4 s8)
   added: (at truck4 s5)
   changed: (fuel-used) from 1070 to 1710
   goals met: 2 of 18
6. (load-truck package9 truck6 s6)
   deleted: (at package9 s6)
   added: (in package9 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 2 of 18
7. (walk driver2 p6-4 s6)
   deleted: (at driver2 p6-4)
   added: (at driver2 s6)
   goals met: 2 of 18
8. (board-truck driver2 truck6 s6)
   deleted: (at driver2 s6) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 2 of 18
9. (drive-truck truck6 s6 s2 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s2)
   changed: (fuel-used) from 1710 to 2447
   goals met: 2 of 18
10. (drive-truck truck4 s5 s8 driver1)
   deleted: (at truck4 s5)
   added: (at truck4 s8)
   changed: (fuel-used) from 2447 to 3087
   goals met: 2 of 18
11. (load-truck package1 truck6 s2)
   deleted: (at package1 s2)
   added: (in package1 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 2 of 18
12. (load-truck package10 truck6 s2)
   deleted: (at package10 s2)
   added: (in package10 truck6)
   changed: (load truck6) from 2 to 3, (fuel-per-minute truck6) from 13 to 16
   goals met: 2 of 18
13. (disembark-truck driver1 truck4 s8)
   deleted: (driving driver1 truck4)
   added: (at driver1 s8) (empty truck4)
   goals met: 2 of 18
14. (drive-truck truck6 s2 s7 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s7)
   changed: (fuel-used) from 3087 to 3215
   goals met: 2 of 18
15. (drive-truck truck6 s7 s1 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s1)
   changed: (fuel-used) from 3215 to 3375
   goals met: 2 of 18
16. (walk driver1 s8 p6-8)
   deleted: (at driver1 s8)
   added: (at driver1 p6-8)
   goals met: 2 of 18
17. (drive-truck truck6 s1 s10 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s10)
   changed: (fuel-used) from 3375 to 4047
   goals met: 2 of 18
18. (unload-truck package10 truck6 s10)
   deleted: (in package10 truck6)
   added: (at package10 s10)
   changed: (load truck6) from 3 to 2, (fuel-per-minute truck6) from 16 to 13
   goals met: 3 of 18
19. (drive-truck truck6 s10 s13 driver2)
   deleted: (at truck6 s10)
   added: (at truck6 s13)
   changed: (fuel-used) from 4047 to 4918
   goals met: 3 of 18
20. (unload-truck package1 truck6 s13)
   deleted: (in package1 truck6)
   added: (at package1 s13)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 4 of 18
21. (drive-truck truck6 s13 s8 driver2)
   deleted: (at truck6 s13)
   added: (at truck6 s8)
   changed: (fuel-used) from 4918 to 5369
   goals met: 4 of 18
22. (drive-truck truck6 s8 s5 driver2)
   deleted: (at truck6 s8)
   added: (at truck6 s5)
   changed: (fuel-used) from 5369 to 6073
   goals met: 5 of 18
23. (disembark-truck driver2 truck6 s5)
   deleted: (driving driver2 truck6)
   added: (at driver2 s5) (empty truck6)
   goals met: 5 of 18
24. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 18
25. (walk driver1 p6-8 s6)
   deleted: (at driver1 p6-8)
   added: (at driver1 s6)
   goals met: 6 of 18
26. (unload-truck package9 truck6 s5)
   deleted: (in package9 truck6)
   added: (at package9 s5)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 6 of 18
27. (load-truck package9 truck2 s5)
   deleted: (at package9 s5)
   added: (in package9 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 18
28. (walk driver3 s1 p8-1)
   deleted: (at driver3 s1)
   added: (at driver3 p8-1)
   goals met: 6 of 18
29. (walk driver3 p8-1 s8)
   deleted: (at driver3 p8-1)
   added: (at driver3 s8)
   goals met: 6 of 18
30. (drive-truck truck2 s5 s8 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   changed: (fuel-used) from 6073 to 6777
   goals met: 6 of 18
31. (load-truck package5 truck2 s8)
   deleted: (at package5 s8)
   added: (in package5 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 6 of 18
32. (drive-truck truck2 s8 s1 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (fuel-used) from 6777 to 6816
   goals met: 6 of 18
33. (drive-truck truck2 s1 s6 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 6816 to 7804
   goals met: 6 of 18
34. (unload-truck package5 truck2 s6)
   deleted: (in package5 truck2)
   added: (at package5 s6)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 7 of 18
35. (drive-truck truck2 s6 s1 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 7804 to 8640
   goals met: 7 of 18
36. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 8640 to 8684
   goals met: 7 of 18
37. (drive-truck truck2 s3 s4 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 8684 to 8750
   goals met: 7 of 18
38. (load-truck package3 truck2 s4)
   deleted: (at package3 s4)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 7 of 18
39. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 8750 to 8828
   goals met: 7 of 18
40. (drive-truck truck2 s3 s5 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 8828 to 9140
   goals met: 7 of 18
41. (unload-truck package3 truck2 s5)
   deleted: (in package3 truck2)
   added: (at package3 s5)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 8 of 18
42. (drive-truck truck2 s5 s8 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   changed: (fuel-used) from 9140 to 9844
   goals met: 8 of 18
43. (drive-truck truck2 s8 s1 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (fuel-used) from 9844 to 9877
   goals met: 8 of 18
44. (board-truck driver3 truck5 s8)
   deleted: (at driver3 s8) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 8 of 18
45. (drive-truck truck2 s1 s7 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 9877 to 9987
   goals met: 8 of 18
46. (load-truck package4 truck2 s7)
   deleted: (at package4 s7)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 8 of 18
47. (drive-truck truck2 s7 s1 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   changed: (fuel-used) from 9987 to 10117
   goals met: 8 of 18
48. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 9 of 18
49. (drive-truck truck2 s1 s7 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 10117 to 10227
   goals met: 9 of 18
50. (load-truck package7 truck2 s7)
   deleted: (at package7 s7)
   added: (in package7 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 9 of 18
51. (drive-truck truck2 s7 s11 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s11)
   changed: (fuel-used) from 10227 to 10799
   goals met: 9 of 18
52. (drive-truck truck5 s8 s0 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s0)
   changed: (fuel-used) from 10799 to 10949
   goals met: 10 of 18
53. (load-truck package8 truck5 s0)
   deleted: (at package8 s0)
   added: (in package8 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 10 of 18
54. (load-truck package12 truck5 s0)
   deleted: (at package12 s0)
   added: (in package12 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 10 of 18
55. (drive-truck truck5 s0 s7 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s7)
   changed: (fuel-used) from 10949 to 12171
   goals met: 9 of 18
56. (unload-truck package8 truck5 s7)
   deleted: (in package8 truck5)
   added: (at package8 s7)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 10 of 18
57. (drive-truck truck5 s7 s0 driver3)
   deleted: (at truck5 s7)
   added: (at truck5 s0)
   changed: (fuel-used) from 12171 to 13205
   goals met: 11 of 18
58. (drive-truck truck2 s11 s12 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s12)
   changed: (fuel-used) from 13205 to 14310
   goals met: 12 of 18
59. (unload-truck package7 truck2 s12)
   deleted: (in package7 truck2)
   added: (at package7 s12)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 13 of 18
60. (drive-truck truck2 s12 s8 driver2)
   deleted: (at truck2 s12)
   added: (at truck2 s8)
   changed: (fuel-used) from 14310 to 14717
   goals met: 12 of 18
61. (drive-truck truck5 s0 s8 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s8)
   changed: (fuel-used) from 14717 to 14882
   goals met: 11 of 18
62. (unload-truck package12 truck5 s8)
   deleted: (in package12 truck5)
   added: (at package12 s8)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 12 of 18
63. (drive-truck truck5 s8 s0 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s0)
   changed: (fuel-used) from 14882 to 15032
   goals met: 13 of 18
64. (drive-truck truck5 s0 s7 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s7)
   changed: (fuel-used) from 15032 to 15972
   goals met: 12 of 18
65. (drive-truck truck5 s7 s10 driver3)
   deleted: (at truck5 s7)
   added: (at truck5 s10)
   changed: (fuel-used) from 15972 to 16332
   goals met: 12 of 18
66. (load-truck package2 truck5 s10)
   deleted: (at package2 s10)
   added: (in package2 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 12 of 18
67. (drive-truck truck5 s10 s7 driver3)
   deleted: (at truck5 s10)
   added: (at truck5 s7)
   changed: (fuel-used) from 16332 to 16728
   goals met: 12 of 18
68. (drive-truck truck5 s7 s4 driver3)
   deleted: (at truck5 s7)
   added: (at truck5 s4)
   changed: (fuel-used) from 16728 to 17740
   goals met: 12 of 18
69. (unload-truck package2 truck5 s4)
   deleted: (in package2 truck5)
   added: (at package2 s4)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 13 of 18
70. (drive-truck truck5 s4 s7 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s7)
   changed: (fuel-used) from 17740 to 18660
   goals met: 13 of 18
71. (drive-truck truck5 s7 s0 driver3)
   deleted: (at truck5 s7)
   added: (at truck5 s0)
   changed: (fuel-used) from 18660 to 19600
   goals met: 14 of 18
72. (drive-truck truck2 s8 s3 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s3)
   changed: (fuel-used) from 19600 to 20238
   goals met: 14 of 18
73. (drive-truck truck5 s0 s8 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s8)
   changed: (fuel-used) from 20238 to 20388
   goals met: 13 of 18
74. (drive-truck truck2 s3 s11 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s11)
   changed: (fuel-used) from 20388 to 21158
   goals met: 13 of 18
75. (drive-truck truck2 s11 s0 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s0)
   changed: (fuel-used) from 21158 to 22225
   goals met: 13 of 18
76. (unload-truck package9 truck2 s0)
   deleted: (in package9 truck2)
   added: (at package9 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 14 of 18
77. (drive-truck truck2 s0 s11 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s11)
   changed: (fuel-used) from 22225 to 23195
   goals met: 14 of 18
78. (disembark-truck driver3 truck5 s8)
   deleted: (driving driver3 truck5)
   added: (at driver3 s8) (empty truck5)
   goals met: 14 of 18
79. (board-truck driver3 truck4 s8)
   deleted: (at driver3 s8) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 14 of 18
80. (drive-truck truck4 s8 s11 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s11)
   changed: (fuel-used) from 23195 to 23285
   goals met: 15 of 18
81. (drive-truck truck2 s11 s8 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s8)
   changed: (fuel-used) from 23285 to 23375
   goals met: 15 of 18
82. (disembark-truck driver2 truck2 s8)
   deleted: (driving driver2 truck2)
   added: (at driver2 s8) (empty truck2)
   goals met: 15 of 18
83. (board-truck driver2 truck5 s8)
   deleted: (at driver2 s8) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 15 of 18
84. (drive-truck truck5 s8 s3 driver2)
   deleted: (at truck5 s8)
   added: (at truck5 s3)
   changed: (fuel-used) from 23375 to 23955
   goals met: 15 of 18
85. (drive-truck truck4 s11 s8 driver3)
   deleted: (at truck4 s11)
   added: (at truck4 s8)
   changed: (fuel-used) from 23955 to 24045
   goals met: 14 of 18
86. (drive-truck truck5 s3 s11 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s11)
   changed: (fuel-used) from 24045 to 24745
   goals met: 14 of 18
87. (drive-truck truck5 s11 s0 driver2)
   deleted: (at truck5 s11)
   added: (at truck5 s0)
   changed: (fuel-used) from 24745 to 25715
   goals met: 15 of 18
88. (disembark-truck driver2 truck5 s0)
   deleted: (driving driver2 truck5)
   added: (at driver2 s0) (empty truck5)
   goals met: 15 of 18
89. (drive-truck truck4 s8 s11 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s11)
   changed: (fuel-used) from 25715 to 25805
   goals met: 16 of 18
90. (walk driver1 s6 p6-8)
   deleted: (at driver1 s6)
   added: (at driver1 p6-8)
   goals met: 15 of 18
91. (walk driver1 p6-8 s8)
   deleted: (at driver1 p6-8)
   added: (at driver1 s8)
   goals met: 15 of 18
92. (board-truck driver1 truck2 s8)
   deleted: (at driver1 s8) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 15 of 18
93. (drive-truck truck2 s8 s12 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s12)
   changed: (fuel-used) from 25805 to 26175
   goals met: 16 of 18
94. (disembark-truck driver1 truck2 s12)
   deleted: (driving driver1 truck2)
   added: (at driver1 s12) (empty truck2)
   goals met: 16 of 18
95. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   goals met: 16 of 18
96. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 17 of 18
97. (walk driver1 s12 p6-12)
   deleted: (at driver1 s12)
   added: (at driver1 p6-12)
   goals met: 17 of 18
98. (walk driver1 p6-12 s6)
   deleted: (at driver1 p6-12)
   added: (at driver1 s6)
   goals met: 18 of 18
